src/assets/artifacts/Spring-PetClinic/telemetry/behavior-models/split_miner/bpmn.mmd
flowchart LR
  n_2797241873616(("2797241873616"))
  n_2797241874960{"X"}
  n_2797241874624["VetRepository.findAll"]
  n_2797242347104["POST /owners/{ownerId}/pets/{petId}/visits/new"]
  n_2797242347456["POST /owners/{ownerId}/pets/{petId}/edit"]
  n_2797241705296["POST /owners/{ownerId}/pets/new"]
  n_2797241706576["POST /owners/{ownerId}/edit"]
  n_2797242009504["POST /owners/new"]
  n_2797241743824["OwnerRepository.save"]
  n_2797241742032["OwnerRepository.findPetTypes"]
  n_2797241742928["OwnerRepository.findByLastName"]
  n_2797241738064["INSERT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.vets"]
  n_2797241738960["INSERT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.vet_specialties"]
  n_2797241738832["INSERT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.types"]
  n_2797241744464["INSERT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.specialties"]
  n_2797241744080["INSERT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.visits"]
  n_2797241740624["INSERT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.vets"]
  n_2797241739472["INSERT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.vet_specialties"]
  n_2797241740880["INSERT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.types"]
  n_2797241740496["INSERT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.specialties"]
  n_2797241739600["INSERT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.pets"]
  n_2797241741264["INSERT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.owners"]
  n_2797241740368["GET /vets.html"]
  n_2797241742800["GET /vets"]
  n_2797241739216["GET /owners/{ownerId}/pets/{petId}/visits/new"]
  n_2797241745232["GET /owners/{ownerId}/pets/{petId}/edit"]
  n_2797241744848["GET /owners/{ownerId}/pets/new"]
  n_2797241740112["GET /owners/{ownerId}/edit"]
  n_2797241732176["GET /owners/new"]
  n_2797241743440["GET /owners/find"]
  n_2797241742288["GET /owners"]
  n_2797241744336["GET"]
  n_2797242298960["DROP TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.visits"]
  n_2797242300752["DROP TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.vets"]
  n_2797242298704["DROP TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.vet_specialties"]
  n_2797242298192["DROP TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.types"]
  n_2797242299088["DROP TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.specialties"]
  n_2797242295888["DROP TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.pets"]
  n_2797242299728["DROP TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.owners"]
  n_2797242298448["DROP TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.visits"]
  n_2797242297680["DROP TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.vets"]
  n_2797242302160["DROP TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.vet_specialties"]
  n_2797242290896["DROP TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.types"]
  n_2797242290256["DROP TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.specialties"]
  n_2797242297296["DROP TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.pets"]
  n_2797242291920["DROP TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.owners"]
  n_2797242296400["CREATE TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.visits"]
  n_2797242286800["CREATE TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.vets"]
  n_2797242296784["CREATE TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.vet_specialties"]
  n_2797242287312["CREATE TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.types"]
  n_2797242291408["CREATE TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.specialties"]
  n_2797242299344["CREATE TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.pets"]
  n_2797242295760["CREATE TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.owners"]
  n_2797242301520["CREATE TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.visits"]
  n_2797242300880["CREATE TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.vets"]
  n_2797242296656["CREATE TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.vet_specialties"]
  n_2797242286544["CREATE TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.types"]
  n_2797242290000["CREATE TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.specialties"]
  n_2797242293840["CREATE TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.pets"]
  n_2797242296144["CREATE TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.owners"]
  n_2797242287824["CREATE INDEX 9f78a28c-0668-4b3b-b691-5b8d19cd8c17"]
  n_2797242293712["CREATE INDEX 29058b98-4ccd-4e90-9f58-e90fdf3b4e76"]
  n_2797242288208["ALTER TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.visits"]
  n_2797242289488["ALTER TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.vet_specialties"]
  n_2797242292944["ALTER TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.pets"]
  n_2797242299984["ALTER TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.visits"]
  n_2797242299856["ALTER TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.vet_specialties"]
  n_2797242289744["ALTER TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.pets"]
  n_2797241515808{"X"}
  n_2797242287440{"X"}
  n_2797242290640{"X"}
  n_2797242301392{"X"}
  n_2797242287952{"X"}
  n_2797241933328["SELECT org.springframework.samples.petclinic.vet.Vet"]
  n_2797241933600["SELECT org.springframework.samples.petclinic.owner.PetType"]
  n_2797241739984["OwnerRepository.findById"]
  n_2797241743056["INSERT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.visits"]
  n_2797241738704["INSERT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.pets"]
  n_2797241735888["INSERT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.owners"]
  n_2797241742160["GET /owners/{ownerId}"]
  n_2797241669008{"X"}
  n_2797241669648{"X"}
  n_2797242348160{"X"}
  n_2797242009792{"X"}
  n_2797241498544["Session.persist org.springframework.samples.petclinic.owner.Owner"]
  n_2797241464976["Session.merge org.springframework.samples.petclinic.owner.Owner"]
  n_2797241749520["SELECT"]
  n_2797241744208["MockHttpServletResponse.sendRedirect"]
  n_2797241496720{"X"}
  n_2797241498240{"X"}
  n_2797242347984{"X"}
  n_2797241996624["SELECT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.vets"]
  n_2797241514128["SELECT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.types"]
  n_2797243077520["SELECT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.vets"]
  n_2797241464688{"X"}
  n_2797241933872{"X"}
  n_2797241669968["UPDATE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.pets"]
  n_2797241667408["UPDATE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.owners"]
  n_2797241934144{"X"}
  n_2797242687312{"X"}
  n_2797242691152{"X"}
  n_2797241515328["SELECT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17"]
  n_2797241749712["SELECT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76"]
  n_2797242693968{"X"}
  n_2797241995856["SELECT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.visits"]
  n_2797242695376{"X"}
  n_2797243139024{"X"}
  n_2797241688064["SELECT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.types"]
  n_2797241515568{"X"}
  n_2797242694096{"X"}
  n_2797241496112["Transaction.commit"]
  n_2797243073264["SELECT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.visits"]
  n_2797241874288(("2797241874288"))
  n_2797241873616 --> n_2797241874960
  n_2797241874960 --> n_2797242289744
  n_2797241874960 --> n_2797242299856
  n_2797241874960 --> n_2797242299984
  n_2797241874960 --> n_2797242292944
  n_2797241874960 --> n_2797242289488
  n_2797241874960 --> n_2797242288208
  n_2797241874960 --> n_2797242293712
  n_2797241874960 --> n_2797242287824
  n_2797241874960 --> n_2797242296144
  n_2797241874960 --> n_2797242293840
  n_2797241874960 --> n_2797242290000
  n_2797241874960 --> n_2797242286544
  n_2797241874960 --> n_2797242296656
  n_2797241874960 --> n_2797242300880
  n_2797241874960 --> n_2797242301520
  n_2797241874960 --> n_2797242295760
  n_2797241874960 --> n_2797242299344
  n_2797241874960 --> n_2797242291408
  n_2797241874960 --> n_2797242287312
  n_2797241874960 --> n_2797242296784
  n_2797241874960 --> n_2797242286800
  n_2797241874960 --> n_2797242296400
  n_2797241874960 --> n_2797242291920
  n_2797241874960 --> n_2797242297296
  n_2797241874960 --> n_2797242290256
  n_2797241874960 --> n_2797242290896
  n_2797241874960 --> n_2797242302160
  n_2797241874960 --> n_2797242297680
  n_2797241874960 --> n_2797242298448
  n_2797241874960 --> n_2797242299728
  n_2797241874960 --> n_2797242295888
  n_2797241874960 --> n_2797242299088
  n_2797241874960 --> n_2797242298192
  n_2797241874960 --> n_2797242298704
  n_2797241874960 --> n_2797242300752
  n_2797241874960 --> n_2797242298960
  n_2797241874960 --> n_2797241744336
  n_2797241874960 --> n_2797241742288
  n_2797241874960 --> n_2797241743440
  n_2797241874960 --> n_2797241732176
  n_2797241874960 --> n_2797241740112
  n_2797241874960 --> n_2797241744848
  n_2797241874960 --> n_2797241745232
  n_2797241874960 --> n_2797241739216
  n_2797241874960 --> n_2797241742800
  n_2797241874960 --> n_2797241740368
  n_2797241874960 --> n_2797241741264
  n_2797241874960 --> n_2797241739600
  n_2797241874960 --> n_2797241740496
  n_2797241874960 --> n_2797241740880
  n_2797241874960 --> n_2797241739472
  n_2797241874960 --> n_2797241740624
  n_2797241874960 --> n_2797241744080
  n_2797241874960 --> n_2797241744464
  n_2797241874960 --> n_2797241738832
  n_2797241874960 --> n_2797241738960
  n_2797241874960 --> n_2797241738064
  n_2797241874960 --> n_2797241742928
  n_2797241874960 --> n_2797241742032
  n_2797241874960 --> n_2797241743824
  n_2797241874960 --> n_2797242009504
  n_2797241874960 --> n_2797241706576
  n_2797241874960 --> n_2797241705296
  n_2797241874960 --> n_2797242347456
  n_2797241874960 --> n_2797242347104
  n_2797241874960 --> n_2797241874624
  n_2797241874960 --> n_2797241515808
  n_2797241874960 --> n_2797242287952
  n_2797241874960 --> n_2797242290640
  n_2797241874960 --> n_2797242301392
  n_2797241874960 --> n_2797242287440
  n_2797241744336 --> n_2797241515808
  n_2797241874624 --> n_2797241933328
  n_2797242347104 --> n_2797241669008
  n_2797242347456 --> n_2797241669008
  n_2797241705296 --> n_2797241669008
  n_2797241706576 --> n_2797241669008
  n_2797242009504 --> n_2797241669008
  n_2797241743824 --> n_2797241669648
  n_2797241742032 --> n_2797241933600
  n_2797241742928 --> n_2797242009792
  n_2797241738064 --> n_2797242348160
  n_2797241738960 --> n_2797242348160
  n_2797241738832 --> n_2797242348160
  n_2797241744464 --> n_2797242348160
  n_2797241744080 --> n_2797242348160
  n_2797241740624 --> n_2797242348160
  n_2797241739472 --> n_2797242348160
  n_2797241740880 --> n_2797242348160
  n_2797241740496 --> n_2797242348160
  n_2797241739600 --> n_2797242348160
  n_2797241741264 --> n_2797242348160
  n_2797241740368 --> n_2797242348160
  n_2797241742800 --> n_2797242348160
  n_2797241739216 --> n_2797242348160
  n_2797241745232 --> n_2797242348160
  n_2797241744848 --> n_2797242348160
  n_2797241740112 --> n_2797242348160
  n_2797241732176 --> n_2797242348160
  n_2797241743440 --> n_2797242348160
  n_2797241742288 --> n_2797241669008
  n_2797242298960 --> n_2797242348160
  n_2797242300752 --> n_2797242348160
  n_2797242298704 --> n_2797242348160
  n_2797242298192 --> n_2797242348160
  n_2797242299088 --> n_2797242348160
  n_2797242295888 --> n_2797242348160
  n_2797242299728 --> n_2797242348160
  n_2797242298448 --> n_2797242348160
  n_2797242297680 --> n_2797242348160
  n_2797242302160 --> n_2797242348160
  n_2797242290896 --> n_2797242348160
  n_2797242290256 --> n_2797242348160
  n_2797242297296 --> n_2797242348160
  n_2797242291920 --> n_2797242348160
  n_2797242296400 --> n_2797242348160
  n_2797242286800 --> n_2797242348160
  n_2797242296784 --> n_2797242348160
  n_2797242287312 --> n_2797242348160
  n_2797242291408 --> n_2797242348160
  n_2797242299344 --> n_2797242348160
  n_2797242295760 --> n_2797242348160
  n_2797242301520 --> n_2797242348160
  n_2797242300880 --> n_2797242348160
  n_2797242296656 --> n_2797242348160
  n_2797242286544 --> n_2797242348160
  n_2797242290000 --> n_2797242348160
  n_2797242293840 --> n_2797242348160
  n_2797242296144 --> n_2797242348160
  n_2797242287824 --> n_2797242348160
  n_2797242293712 --> n_2797242348160
  n_2797242288208 --> n_2797242348160
  n_2797242289488 --> n_2797242348160
  n_2797242292944 --> n_2797242348160
  n_2797242299984 --> n_2797242348160
  n_2797242299856 --> n_2797242348160
  n_2797242289744 --> n_2797242348160
  n_2797241515808 --> n_2797241742160
  n_2797242287440 --> n_2797241739984
  n_2797242290640 --> n_2797241743056
  n_2797242301392 --> n_2797241738704
  n_2797242287952 --> n_2797241735888
  n_2797241739984 --> n_2797242009792
  n_2797241743056 --> n_2797242348160
  n_2797241738704 --> n_2797242348160
  n_2797241735888 --> n_2797242348160
  n_2797241669008 --> n_2797242348160
  n_2797241933328 --> n_2797241498240
  n_2797241933600 --> n_2797242347984
  n_2797241742160 --> n_2797241496720
  n_2797241669008 --> n_2797241744208
  n_2797241669648 --> n_2797241464976
  n_2797241669648 --> n_2797241498544
  n_2797242009792 --> n_2797241749520
  n_2797242348160 --> n_2797241874288
  n_2797241498544 --> n_2797242287952
  n_2797241496720 --> n_2797242287440
  n_2797241744208 --> n_2797242348160
  n_2797241496720 --> n_2797242348160
  n_2797241464976 --> n_2797241464688
  n_2797241749520 --> n_2797241933872
  n_2797241498240 --> n_2797243077520
  n_2797241498240 --> n_2797241996624
  n_2797242347984 --> n_2797241514128
  n_2797241464688 --> n_2797242290640
  n_2797241464688 --> n_2797242301392
  n_2797241464688 --> n_2797242348160
  n_2797241996624 --> n_2797242687312
  n_2797241514128 --> n_2797241934144
  n_2797243077520 --> n_2797242691152
  n_2797241933872 --> n_2797241667408
  n_2797241933872 --> n_2797241669968
  n_2797241933872 --> n_2797242691152
  n_2797241933872 --> n_2797242687312
  n_2797241934144 --> n_2797242348160
  n_2797241669968 --> n_2797242687312
  n_2797241667408 --> n_2797242687312
  n_2797241934144 --> n_2797242693968
  n_2797242687312 --> n_2797241515328
  n_2797242691152 --> n_2797241749712
  n_2797241515328 --> n_2797242695376
  n_2797241749712 --> n_2797243139024
  n_2797242693968 --> n_2797241995856
  n_2797242695376 --> n_2797242348160
  n_2797242695376 --> n_2797242347984
  n_2797242695376 --> n_2797242687312
  n_2797243139024 --> n_2797242691152
  n_2797241995856 --> n_2797242694096
  n_2797243139024 --> n_2797241515568
  n_2797243139024 --> n_2797241688064
  n_2797242694096 --> n_2797242348160
  n_2797242694096 --> n_2797242693968
  n_2797241688064 --> n_2797243073264
  n_2797241515568 --> n_2797241496112
  n_2797241496112 --> n_2797241496720
  n_2797243073264 --> n_2797241515568
  style n_2797241873616 fill:green
  style n_2797241874288 fill:orange
