src/assets/artifacts/Spring-PetClinic/telemetry/behavior-models/split_miner/split_miner.dot
digraph {
	graph [bgcolor=white rankdir=LR]
	2797241873616 [label="" fillcolor=green fontsize=12 shape=circle style=filled]
	2797241874960 [label=X fontsize=12 shape=diamond]
	2797241874624 [label="VetRepository.findAll" fontsize=12 shape=box]
	2797242347104 [label="POST /owners/{ownerId}/pets/{petId}/visits/new" fontsize=12 shape=box]
	2797242347456 [label="POST /owners/{ownerId}/pets/{petId}/edit" fontsize=12 shape=box]
	2797241705296 [label="POST /owners/{ownerId}/pets/new" fontsize=12 shape=box]
	2797241706576 [label="POST /owners/{ownerId}/edit" fontsize=12 shape=box]
	2797242009504 [label="POST /owners/new" fontsize=12 shape=box]
	2797241743824 [label="OwnerRepository.save" fontsize=12 shape=box]
	2797241742032 [label="OwnerRepository.findPetTypes" fontsize=12 shape=box]
	2797241742928 [label="OwnerRepository.findByLastName" fontsize=12 shape=box]
	2797241738064 [label="INSERT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.vets" fontsize=12 shape=box]
	2797241738960 [label="INSERT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.vet_specialties" fontsize=12 shape=box]
	2797241738832 [label="INSERT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.types" fontsize=12 shape=box]
	2797241744464 [label="INSERT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.specialties" fontsize=12 shape=box]
	2797241744080 [label="INSERT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.visits" fontsize=12 shape=box]
	2797241740624 [label="INSERT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.vets" fontsize=12 shape=box]
	2797241739472 [label="INSERT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.vet_specialties" fontsize=12 shape=box]
	2797241740880 [label="INSERT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.types" fontsize=12 shape=box]
	2797241740496 [label="INSERT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.specialties" fontsize=12 shape=box]
	2797241739600 [label="INSERT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.pets" fontsize=12 shape=box]
	2797241741264 [label="INSERT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.owners" fontsize=12 shape=box]
	2797241740368 [label="GET /vets.html" fontsize=12 shape=box]
	2797241742800 [label="GET /vets" fontsize=12 shape=box]
	2797241739216 [label="GET /owners/{ownerId}/pets/{petId}/visits/new" fontsize=12 shape=box]
	2797241745232 [label="GET /owners/{ownerId}/pets/{petId}/edit" fontsize=12 shape=box]
	2797241744848 [label="GET /owners/{ownerId}/pets/new" fontsize=12 shape=box]
	2797241740112 [label="GET /owners/{ownerId}/edit" fontsize=12 shape=box]
	2797241732176 [label="GET /owners/new" fontsize=12 shape=box]
	2797241743440 [label="GET /owners/find" fontsize=12 shape=box]
	2797241742288 [label="GET /owners" fontsize=12 shape=box]
	2797241744336 [label=GET fontsize=12 shape=box]
	2797242298960 [label="DROP TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.visits" fontsize=12 shape=box]
	2797242300752 [label="DROP TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.vets" fontsize=12 shape=box]
	2797242298704 [label="DROP TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.vet_specialties" fontsize=12 shape=box]
	2797242298192 [label="DROP TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.types" fontsize=12 shape=box]
	2797242299088 [label="DROP TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.specialties" fontsize=12 shape=box]
	2797242295888 [label="DROP TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.pets" fontsize=12 shape=box]
	2797242299728 [label="DROP TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.owners" fontsize=12 shape=box]
	2797242298448 [label="DROP TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.visits" fontsize=12 shape=box]
	2797242297680 [label="DROP TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.vets" fontsize=12 shape=box]
	2797242302160 [label="DROP TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.vet_specialties" fontsize=12 shape=box]
	2797242290896 [label="DROP TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.types" fontsize=12 shape=box]
	2797242290256 [label="DROP TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.specialties" fontsize=12 shape=box]
	2797242297296 [label="DROP TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.pets" fontsize=12 shape=box]
	2797242291920 [label="DROP TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.owners" fontsize=12 shape=box]
	2797242296400 [label="CREATE TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.visits" fontsize=12 shape=box]
	2797242286800 [label="CREATE TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.vets" fontsize=12 shape=box]
	2797242296784 [label="CREATE TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.vet_specialties" fontsize=12 shape=box]
	2797242287312 [label="CREATE TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.types" fontsize=12 shape=box]
	2797242291408 [label="CREATE TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.specialties" fontsize=12 shape=box]
	2797242299344 [label="CREATE TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.pets" fontsize=12 shape=box]
	2797242295760 [label="CREATE TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.owners" fontsize=12 shape=box]
	2797242301520 [label="CREATE TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.visits" fontsize=12 shape=box]
	2797242300880 [label="CREATE TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.vets" fontsize=12 shape=box]
	2797242296656 [label="CREATE TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.vet_specialties" fontsize=12 shape=box]
	2797242286544 [label="CREATE TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.types" fontsize=12 shape=box]
	2797242290000 [label="CREATE TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.specialties" fontsize=12 shape=box]
	2797242293840 [label="CREATE TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.pets" fontsize=12 shape=box]
	2797242296144 [label="CREATE TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.owners" fontsize=12 shape=box]
	2797242287824 [label="CREATE INDEX 9f78a28c-0668-4b3b-b691-5b8d19cd8c17" fontsize=12 shape=box]
	2797242293712 [label="CREATE INDEX 29058b98-4ccd-4e90-9f58-e90fdf3b4e76" fontsize=12 shape=box]
	2797242288208 [label="ALTER TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.visits" fontsize=12 shape=box]
	2797242289488 [label="ALTER TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.vet_specialties" fontsize=12 shape=box]
	2797242292944 [label="ALTER TABLE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.pets" fontsize=12 shape=box]
	2797242299984 [label="ALTER TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.visits" fontsize=12 shape=box]
	2797242299856 [label="ALTER TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.vet_specialties" fontsize=12 shape=box]
	2797242289744 [label="ALTER TABLE 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.pets" fontsize=12 shape=box]
	2797241515808 [label=X fontsize=12 shape=diamond]
	2797242287440 [label=X fontsize=12 shape=diamond]
	2797242290640 [label=X fontsize=12 shape=diamond]
	2797242301392 [label=X fontsize=12 shape=diamond]
	2797242287952 [label=X fontsize=12 shape=diamond]
	2797241933328 [label="SELECT org.springframework.samples.petclinic.vet.Vet" fontsize=12 shape=box]
	2797241933600 [label="SELECT org.springframework.samples.petclinic.owner.PetType" fontsize=12 shape=box]
	2797241739984 [label="OwnerRepository.findById" fontsize=12 shape=box]
	2797241743056 [label="INSERT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.visits" fontsize=12 shape=box]
	2797241738704 [label="INSERT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.pets" fontsize=12 shape=box]
	2797241735888 [label="INSERT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.owners" fontsize=12 shape=box]
	2797241742160 [label="GET /owners/{ownerId}" fontsize=12 shape=box]
	2797241669008 [label=X fontsize=12 shape=diamond]
	2797241669648 [label=X fontsize=12 shape=diamond]
	2797242348160 [label=X fontsize=12 shape=diamond]
	2797242009792 [label=X fontsize=12 shape=diamond]
	2797241498544 [label="Session.persist org.springframework.samples.petclinic.owner.Owner" fontsize=12 shape=box]
	2797241464976 [label="Session.merge org.springframework.samples.petclinic.owner.Owner" fontsize=12 shape=box]
	2797241749520 [label=SELECT fontsize=12 shape=box]
	2797241744208 [label="MockHttpServletResponse.sendRedirect" fontsize=12 shape=box]
	2797241496720 [label=X fontsize=12 shape=diamond]
	2797241498240 [label=X fontsize=12 shape=diamond]
	2797242347984 [label=X fontsize=12 shape=diamond]
	2797241996624 [label="SELECT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.vets" fontsize=12 shape=box]
	2797241514128 [label="SELECT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.types" fontsize=12 shape=box]
	2797243077520 [label="SELECT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.vets" fontsize=12 shape=box]
	2797241464688 [label=X fontsize=12 shape=diamond]
	2797241933872 [label=X fontsize=12 shape=diamond]
	2797241669968 [label="UPDATE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.pets" fontsize=12 shape=box]
	2797241667408 [label="UPDATE 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.owners" fontsize=12 shape=box]
	2797241934144 [label=X fontsize=12 shape=diamond]
	2797242687312 [label=X fontsize=12 shape=diamond]
	2797242691152 [label=X fontsize=12 shape=diamond]
	2797241515328 [label="SELECT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17" fontsize=12 shape=box]
	2797241749712 [label="SELECT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76" fontsize=12 shape=box]
	2797242693968 [label=X fontsize=12 shape=diamond]
	2797241995856 [label="SELECT 9f78a28c-0668-4b3b-b691-5b8d19cd8c17.visits" fontsize=12 shape=box]
	2797242695376 [label=X fontsize=12 shape=diamond]
	2797243139024 [label=X fontsize=12 shape=diamond]
	2797241688064 [label="SELECT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.types" fontsize=12 shape=box]
	2797241515568 [label=X fontsize=12 shape=diamond]
	2797242694096 [label=X fontsize=12 shape=diamond]
	2797241496112 [label="Transaction.commit" fontsize=12 shape=box]
	2797243073264 [label="SELECT 29058b98-4ccd-4e90-9f58-e90fdf3b4e76.visits" fontsize=12 shape=box]
	2797241874288 [label="" fillcolor=orange fontsize=12 shape=circle style=filled]
	2797241873616 -> 2797241874960
	2797241874960 -> 2797242289744
	2797241874960 -> 2797242299856
	2797241874960 -> 2797242299984
	2797241874960 -> 2797242292944
	2797241874960 -> 2797242289488
	2797241874960 -> 2797242288208
	2797241874960 -> 2797242293712
	2797241874960 -> 2797242287824
	2797241874960 -> 2797242296144
	2797241874960 -> 2797242293840
	2797241874960 -> 2797242290000
	2797241874960 -> 2797242286544
	2797241874960 -> 2797242296656
	2797241874960 -> 2797242300880
	2797241874960 -> 2797242301520
	2797241874960 -> 2797242295760
	2797241874960 -> 2797242299344
	2797241874960 -> 2797242291408
	2797241874960 -> 2797242287312
	2797241874960 -> 2797242296784
	2797241874960 -> 2797242286800
	2797241874960 -> 2797242296400
	2797241874960 -> 2797242291920
	2797241874960 -> 2797242297296
	2797241874960 -> 2797242290256
	2797241874960 -> 2797242290896
	2797241874960 -> 2797242302160
	2797241874960 -> 2797242297680
	2797241874960 -> 2797242298448
	2797241874960 -> 2797242299728
	2797241874960 -> 2797242295888
	2797241874960 -> 2797242299088
	2797241874960 -> 2797242298192
	2797241874960 -> 2797242298704
	2797241874960 -> 2797242300752
	2797241874960 -> 2797242298960
	2797241874960 -> 2797241744336
	2797241874960 -> 2797241742288
	2797241874960 -> 2797241743440
	2797241874960 -> 2797241732176
	2797241874960 -> 2797241740112
	2797241874960 -> 2797241744848
	2797241874960 -> 2797241745232
	2797241874960 -> 2797241739216
	2797241874960 -> 2797241742800
	2797241874960 -> 2797241740368
	2797241874960 -> 2797241741264
	2797241874960 -> 2797241739600
	2797241874960 -> 2797241740496
	2797241874960 -> 2797241740880
	2797241874960 -> 2797241739472
	2797241874960 -> 2797241740624
	2797241874960 -> 2797241744080
	2797241874960 -> 2797241744464
	2797241874960 -> 2797241738832
	2797241874960 -> 2797241738960
	2797241874960 -> 2797241738064
	2797241874960 -> 2797241742928
	2797241874960 -> 2797241742032
	2797241874960 -> 2797241743824
	2797241874960 -> 2797242009504
	2797241874960 -> 2797241706576
	2797241874960 -> 2797241705296
	2797241874960 -> 2797242347456
	2797241874960 -> 2797242347104
	2797241874960 -> 2797241874624
	2797241874960 -> 2797241515808
	2797241874960 -> 2797242287952
	2797241874960 -> 2797242290640
	2797241874960 -> 2797242301392
	2797241874960 -> 2797242287440
	2797241744336 -> 2797241515808
	2797241874624 -> 2797241933328
	2797242347104 -> 2797241669008
	2797242347456 -> 2797241669008
	2797241705296 -> 2797241669008
	2797241706576 -> 2797241669008
	2797242009504 -> 2797241669008
	2797241743824 -> 2797241669648
	2797241742032 -> 2797241933600
	2797241742928 -> 2797242009792
	2797241738064 -> 2797242348160
	2797241738960 -> 2797242348160
	2797241738832 -> 2797242348160
	2797241744464 -> 2797242348160
	2797241744080 -> 2797242348160
	2797241740624 -> 2797242348160
	2797241739472 -> 2797242348160
	2797241740880 -> 2797242348160
	2797241740496 -> 2797242348160
	2797241739600 -> 2797242348160
	2797241741264 -> 2797242348160
	2797241740368 -> 2797242348160
	2797241742800 -> 2797242348160
	2797241739216 -> 2797242348160
	2797241745232 -> 2797242348160
	2797241744848 -> 2797242348160
	2797241740112 -> 2797242348160
	2797241732176 -> 2797242348160
	2797241743440 -> 2797242348160
	2797241742288 -> 2797241669008
	2797242298960 -> 2797242348160
	2797242300752 -> 2797242348160
	2797242298704 -> 2797242348160
	2797242298192 -> 2797242348160
	2797242299088 -> 2797242348160
	2797242295888 -> 2797242348160
	2797242299728 -> 2797242348160
	2797242298448 -> 2797242348160
	2797242297680 -> 2797242348160
	2797242302160 -> 2797242348160
	2797242290896 -> 2797242348160
	2797242290256 -> 2797242348160
	2797242297296 -> 2797242348160
	2797242291920 -> 2797242348160
	2797242296400 -> 2797242348160
	2797242286800 -> 2797242348160
	2797242296784 -> 2797242348160
	2797242287312 -> 2797242348160
	2797242291408 -> 2797242348160
	2797242299344 -> 2797242348160
	2797242295760 -> 2797242348160
	2797242301520 -> 2797242348160
	2797242300880 -> 2797242348160
	2797242296656 -> 2797242348160
	2797242286544 -> 2797242348160
	2797242290000 -> 2797242348160
	2797242293840 -> 2797242348160
	2797242296144 -> 2797242348160
	2797242287824 -> 2797242348160
	2797242293712 -> 2797242348160
	2797242288208 -> 2797242348160
	2797242289488 -> 2797242348160
	2797242292944 -> 2797242348160
	2797242299984 -> 2797242348160
	2797242299856 -> 2797242348160
	2797242289744 -> 2797242348160
	2797241515808 -> 2797241742160
	2797242287440 -> 2797241739984
	2797242290640 -> 2797241743056
	2797242301392 -> 2797241738704
	2797242287952 -> 2797241735888
	2797241739984 -> 2797242009792
	2797241743056 -> 2797242348160
	2797241738704 -> 2797242348160
	2797241735888 -> 2797242348160
	2797241669008 -> 2797242348160
	2797241933328 -> 2797241498240
	2797241933600 -> 2797242347984
	2797241742160 -> 2797241496720
	2797241669008 -> 2797241744208
	2797241669648 -> 2797241464976
	2797241669648 -> 2797241498544
	2797242009792 -> 2797241749520
	2797242348160 -> 2797241874288
	2797241498544 -> 2797242287952
	2797241496720 -> 2797242287440
	2797241744208 -> 2797242348160
	2797241496720 -> 2797242348160
	2797241464976 -> 2797241464688
	2797241749520 -> 2797241933872
	2797241498240 -> 2797243077520
	2797241498240 -> 2797241996624
	2797242347984 -> 2797241514128
	2797241464688 -> 2797242290640
	2797241464688 -> 2797242301392
	2797241464688 -> 2797242348160
	2797241996624 -> 2797242687312
	2797241514128 -> 2797241934144
	2797243077520 -> 2797242691152
	2797241933872 -> 2797241667408
	2797241933872 -> 2797241669968
	2797241933872 -> 2797242691152
	2797241933872 -> 2797242687312
	2797241934144 -> 2797242348160
	2797241669968 -> 2797242687312
	2797241667408 -> 2797242687312
	2797241934144 -> 2797242693968
	2797242687312 -> 2797241515328
	2797242691152 -> 2797241749712
	2797241515328 -> 2797242695376
	2797241749712 -> 2797243139024
	2797242693968 -> 2797241995856
	2797242695376 -> 2797242348160
	2797242695376 -> 2797242347984
	2797242695376 -> 2797242687312
	2797243139024 -> 2797242691152
	2797241995856 -> 2797242694096
	2797243139024 -> 2797241515568
	2797243139024 -> 2797241688064
	2797242694096 -> 2797242348160
	2797242694096 -> 2797242693968
	2797241688064 -> 2797243073264
	2797241515568 -> 2797241496112
	2797241496112 -> 2797241496720
	2797243073264 -> 2797241515568
	overlap=false
}
